# DimToInserts Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimToInserts Property
ParameterTypeId Class See Also
---
"Dimension To Openings"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimToInserts { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimToInserts As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimToInserts {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace